In [1]:
!pip install cassandra-driver

Requirement already satisfied: cassandra-driver in c:\users\argha\anaconda3\lib\site-packages (3.25.0)
Requirement already satisfied: six>=1.9 in c:\users\argha\anaconda3\lib\site-packages (from cassandra-driver) (1.16.0)
Requirement already satisfied: geomet<0.3,>=0.1 in c:\users\argha\anaconda3\lib\site-packages (from cassandra-driver) (0.2.1.post1)
Requirement already satisfied: click in c:\users\argha\anaconda3\lib\site-packages (from geomet<0.3,>=0.1->cassandra-driver) (8.0.4)
Requirement already satisfied: colorama in c:\users\argha\anaconda3\lib\site-packages (from click->geomet<0.3,>=0.1->cassandra-driver) (0.4.4)

In [2]:
import cassandra
print(cassandra.__version__)

3.25.0

In [4]:
# FOR CONNECTING TO CLOUD SYSTEM
from cassandra.cluster import Cluster
from cassandra.auth import PlainTextAuthProvider

cloud_config= {
        'secure_connect_bundle': 'E:\secure-connect-test123.zip'
}
auth_provider = PlainTextAuthProvider('PkcfitKMxsrjSfdtnKkjqXFd', 'uF.hf54vdib4n6tnahi3gf5ce.vkufF-Il9ansKjL6cOr2e7NkIk0PL9,jDe947AgO1XYaGN7mYr-Bs7+Tgwaj.pQzRav9rXyB72mZSBorp+ZQXA4etj_fJ5HJjjG2r4')
cluster = Cluster(cloud=cloud_config, auth_provider=auth_provider)
session = cluster.connect()

row = session.execute("select release_version from system.local").one()
if row:
    print(row[0])
else:
    print("An error occurred.")

4.0.0.6816

In [ ]:
# FOR CONNECTING TO LOCAL SYSTEM
from cassandra.cluster import Cluster
#from cassandra.auth import PlainTextAuthProvider

#cloud_config= {'secure_connect_bundle':r'C:\Users\Admin\Downloads\secure-connect-test.zip'}
#auth_provider = PlainTextAuthProvider('xbCLnGiTgbFemYjnNKyXmdJk', 'uZQFsScneNQ8+WhqNmLehyRXNZ4HZ233ktFIw1fkCulK,czUQ7hGkJJze4lzHU2Mcl7vOMm56,7sQJYiFLIUwQzjw4BEeWufXeaMC8vG1exmzGaoQ+glmBLW8+48tIAd')
cluster = Cluster()
session = cluster.connect()

row = session.execute("select release_version from system.local")
print(row)

In [ ]:
# create keyspace in database
row = session.execute("CREATE KEYSPACE home WITH replication = {'class': 'SimpleStrategy', 'replication_factor' : 4};")

In [5]:
#use keyspace
row=session.execute("use home;")

In [ ]:
# alter keyspace
row=session.execute("ALTER KEYSPACE home WITH replication = {'class': 'SimpleStrategy', 'replication_factor' : 3};")

In [ ]:
#dropping the keyspace
row=session.execute("DROP KEYSPACE home;")

In [ ]:
try:
    row=session.execute("use home;")
except Exception as e:
    print(e)

In [ ]:
row = session.execute("CREATE KEYSPACE home WITH replication = {'class': 'SimpleStrategy', 'replication_factor' : 4};")

In [18]:
#creating table in the keyspace
row=session.execute("CREATE TABLE Members(id int PRIMARY KEY,name text,age int,height int);")

In [19]:
#inserting into table
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (1,'mohit',25,160);")

In [20]:
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (2,'shubham',26,165);")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (3,'aradhana',25,142);")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (4,'rakesh',55,157);")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (5,'poonam',52,145);")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (6,'seema',30,145);")

In [21]:
#view the data in table
row=session.execute("select * from Members;")
for i in row:
    print(i)

Row(id=5, age=52, height=145, name='poonam')
Row(id=1, age=25, height=160, name='mohit')
Row(id=2, age=26, height=165, name='shubham')
Row(id=4, age=55, height=157, name='rakesh')
Row(id=6, age=30, height=145, name='seema')
Row(id=3, age=25, height=142, name='aradhana')

In [22]:
#not inserting value in some column
row=session.execute("INSERT INTO Members(id,name,age) VALUES (9,'sakshi',32);")

In [23]:
#view the data in table 
row=session.execute("select * from Members;")
for i in row:
    print(i)
#null where data not given

Row(id=5, age=52, height=145, name='poonam')
Row(id=1, age=25, height=160, name='mohit')
Row(id=2, age=26, height=165, name='shubham')
Row(id=4, age=55, height=157, name='rakesh')
Row(id=6, age=30, height=145, name='seema')
Row(id=9, age=32, height=None, name='sakshi')
Row(id=3, age=25, height=142, name='aradhana')

In [24]:
#alter existing table (adding more columns to table)
row=session.execute("ALTER TABLE Members ADD email varchar;")

In [25]:
row=session.execute("select * from Members;")
for i in row:
    print(i)

Row(id=5, age=52, email=None, height=145, name='poonam')
Row(id=1, age=25, email=None, height=160, name='mohit')
Row(id=2, age=26, email=None, height=165, name='shubham')
Row(id=4, age=55, email=None, height=157, name='rakesh')
Row(id=6, age=30, email=None, height=145, name='seema')
Row(id=9, age=32, email=None, height=None, name='sakshi')
Row(id=3, age=25, email=None, height=142, name='aradhana')

In [26]:
#dropping the table
row=session.execute("DROP TABLE if exists Member;")

In [27]:
#truncating (removing all data from table)
row=session.execute("TRUNCATE Members;")

In [28]:
#table is empty now
for i in row:
    print(i)

In [29]:
#INSERING DATA 
row=session.execute("INSERT INTO Members(id,name,age,height,email) VALUES (2,'shubham',26,165,'memohit@gmail.com');")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (3,'aradhana',25,142);")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (4,'rakesh',55,157);")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (5,'poonam',52,145);")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (6,'seema',30,145);")

In [30]:
#update existing table 
row=session.execute("UPDATE home.Members SET name= 'Mohit Raghav',age = 28 WHERE id=1;")

In [31]:
#view the data in table 
row=session.execute("select * from Members;")
for i in row:
    print(i)

Row(id=5, age=52, email=None, height=145, name='poonam')
Row(id=1, age=28, email=None, height=None, name='Mohit Raghav')
Row(id=2, age=26, email='memohit@gmail.com', height=165, name='shubham')
Row(id=4, age=55, email=None, height=157, name='rakesh')
Row(id=6, age=30, email=None, height=145, name='seema')
Row(id=3, age=25, email=None, height=142, name='aradhana')

In [32]:
#delete a particular row or a part of row
row=session.execute("DELETE age FROM Members WHERE id=3;")

In [33]:
#view the data in table 
row=session.execute("select * from Members;")
for i in row:
    print(i)

Row(id=5, age=52, email=None, height=145, name='poonam')
Row(id=1, age=28, email=None, height=None, name='Mohit Raghav')
Row(id=2, age=26, email='memohit@gmail.com', height=165, name='shubham')
Row(id=4, age=55, email=None, height=157, name='rakesh')
Row(id=6, age=30, email=None, height=145, name='seema')
Row(id=3, age=None, email=None, height=142, name='aradhana')

In [34]:
#selecting particular data
row=session.execute("SELECT name, age FROM Members WHERE id = 1;")

In [35]:
for i in row:
    print(i)

Row(name='Mohit Raghav', age=28)